ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
/**
 * @file    datalog.c
 * @brief   Append-only kruhovy log stability mereni. Viz datalog.h.
 *
 * ── Rozvrzeni na ulozisti ──────────────────────────────────────────────────
 * Region = pole zaznamu po 32 B. Erase blok (W25Q sektor 4096 B) pojme presne
 * 128 zaznamu. Zapisuje se cistě dopredu; na hranici bloku se blok NEJDRIV smaze
 * (u NOR; u SD backendu erase_size==0 a krok odpada) a tim se zahodi 128
 * nejstarsich zaznamu -> kruh. Zadna metadata mimo zaznamy: pozice zapisu se po
 * bootu ODVODI ze seq cisel (viz find_head), takze log prezije reset i vypadek
 * napajeni bez zvlastni hlavicky.
 *
 * `seq` je monotonni pres cely region a zaroven slouzi jako priznak obsazenosti:
 * smazana flash = 0xFF -> seq == DATALOG_SEQ_EMPTY == volny slot.
 */
#include "datalog.h"
#include "w25q.h"
#include "w25q_map.h"
#include "freertos_shared.h"   /* g_sensors, g_rtc_text, g_spi_ok, qspiMutexHandle */
#include "fpga_freq.h"
#include "gps.h"
#include "si5356.h"   /* SI5356_LOS_CLKIN/PLL_LOL — priznak neplatne reference */
#include "errlog.h"    /* udalosti: chyba zapisu, zmena nastaveni */
#include "cmsis_os2.h"
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <string.h>

/* Timeouty QSPI mutexu: tick bezi v defaultTask (krmi watchdog) -> pri obsazene
 * sbernici zapis radeji vynecha a zkusi za DATALOG_PERIOD_S znovu. Cteni/erase
 * z UI/UART smi cekat dele (erase sektoru az ~400 ms). */
#define DL_LOCK_TICK_MS   10u
#define DL_LOCK_READ_MS   500u
#define DL_LOCK_ERASE_MS  2000u

#define RECS_PER_BLOCK(b) ((b)->erase_size ? (b)->erase_size / DATALOG_REC_SIZE : 0u)

static const datalog_backend_t *s_be;
static bool     s_ready;
static bool     s_enabled = true;      /* prepisuje syscfg_load pres datalog_set_enabled */
static uint32_t s_head;                /* offset dalsiho zapisu [B] */
static uint32_t s_seq;                 /* seq posledniho zapsaneho (0 = zadny) */
static uint32_t s_count;               /* pocet platnych zaznamu (strop = capacity_rec) */
static uint32_t s_errors;
static bool     s_wrapped;
static uint32_t s_next_ms;             /* HAL_GetTick kdy vzorkovat priste */
static uint16_t s_period_s = DATALOG_PERIOD_S;   /* runtime perioda vzorkovani */
static uint8_t  s_store_pref = DATALOG_STORE_AUTO;

uint16_t datalog_period_s(void) { return s_period_s ? s_period_s : DATALOG_PERIOD_S; }

void datalog_set_period_s(uint16_t sec)
{
    if (sec < 1u) sec = 1u;
    if (sec > 3600u) sec = 3600u;
    if (sec == s_period_s) return;
    uint16_t old_p = s_period_s;
    s_period_s = sec;
    (void)errlog_put(ERRLOG_K_CFG, ERRLOG_CFG_LOGPER, sec, old_p, "logT");
    /* Prepocitat AZ TED, aby zmena platila od pristiho vzorku a ne az za starou
     * periodou (pri 600 s by uzivatel cekal 10 minut, nez se to projevi). */
    s_next_ms = HAL_GetTick() + (uint32_t)sec * 1000u;
}

uint8_t datalog_get_store(void) { return s_store_pref; }

/* Prepne uloziste za behu. ⚠️ Musi znovu najit hlavu, protoze kazde medium ma
 * vlastni `seq` i pocet zaznamu — bez re-initu by se zapisovalo na pozici
 * platnou pro to druhe. Historie na opustenem mediu ZUSTAVA (jen ji `dump`
 * neuvidi), coz je zamer: prepnuti nesmi nic smazat. */
void datalog_set_store(uint8_t store)
{
    if (store > DATALOG_STORE_SD) store = DATALOG_STORE_AUTO;
    if (store == s_store_pref) return;
    uint8_t old_st = s_store_pref;
    s_store_pref = store;
    (void)errlog_put(ERRLOG_K_CFG, ERRLOG_CFG_LOGSTORE, store, old_st, "logKam");
    datalog_init();
}

const char *datalog_store_name(uint8_t store)
{
    switch (store) {
    case DATALOG_STORE_FLASH: return "FLASH";
    case DATALOG_STORE_SD:    return "SD";
    default:                  return "AUTO";
    }
}

int datalog_adev_stage(void)
{
    /* tau stage s = 10^s s. Exaktne sedi jen mocnina deseti. */
    uint32_t p = datalog_period_s();
    int stage = 0;
    while (p >= 10u) {
        if (p % 10u) return -1;
        p /= 10u; stage++;
    }
    return (p == 1u) ? stage : -1;
}

/* ── Serializace zaznamu (LE, bez zavislosti na paddingu struktury) ────────── */

static uint16_t crc16(const uint8_t *d, uint32_t n)
{
    uint16_t c = 0xFFFF;                       /* CRC-16/CCITT-FALSE (jako w25q_store/FPGA) */
    for (uint32_t i = 0; i < n; i++) {
        c ^= (uint16_t)d[i] << 8;
        for (int b = 0; b < 8; b++)
            c = (c & 0x8000) ? (uint16_t)((c << 1) ^ 0x1021) : (uint16_t)(c << 1);
    }
    return c;
}

/* ⚠️ Sdilena i mimo datalog (`errlog` pouziva TENTYZ zaznamovy vzor vcetne CRC) —
 * ctvrta kopie tehoz polynomu v projektu by se driv nebo pozdeji rozesla (SKILL 5). */
uint16_t datalog_crc16(const uint8_t *d, uint32_t n) { return crc16(d, n); }

static void put_u16(uint8_t *p, uint16_t v) { p[0] = (uint8_t)v; p[1] = (uint8_t)(v >> 8); }
static void put_u32(uint8_t *p, uint32_t v)
{
    p[0] = (uint8_t)v;         p[1] = (uint8_t)(v >> 8);
    p[2] = (uint8_t)(v >> 16); p[3] = (uint8_t)(v >> 24);
}
static void put_u64(uint8_t *p, uint64_t v) { put_u32(p, (uint32_t)v); put_u32(p + 4, (uint32_t)(v >> 32)); }
static uint16_t get_u16(const uint8_t *p) { return (uint16_t)(p[0] | ((uint16_t)p[1] << 8)); }
static uint32_t get_u32(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}
static uint64_t get_u64(const uint8_t *p) { return (uint64_t)get_u32(p) | ((uint64_t)get_u32(p + 4) << 32); }

/* Rozvrzeni 32B zaznamu: 0 seq, 4 t_unix, 8 freq, 16 t_ocxo, 18 t_board,
 * 20 vc_mv, 22 rf_mv, 24 flags, 25 sats, 26 hdop10, 27 vbat (8 mV krok,
 * 0 = nezaznamenano), 28 CRC16 (bajty 0..27), 30 rezerva.
 * ⚠️ Bajt 27 byl do 2026-08-17 `spare` (vzdy 0) a je UVNITR CRC. Diky tomu, ze
 * je 0 vyhrazena jako "nezaznamenano", se stare zaznamy ctou dal spravne a
 * format zustava 32 B — zadna migrace ani verze zaznamu netreba. */
static uint8_t vbat_encode(int16_t mv)
{
    if (mv == DATALOG_INVALID16) return DATALOG_VBAT_NONE;
    int32_t code = ((int32_t)mv - DATALOG_VBAT_BASE_MV) / DATALOG_VBAT_STEP_MV;
    if (code < 1)   code = 1;     /* pod 2008 mV je CR2032 stejne mrtva; 0 = sentinel */
    if (code > 255) code = 255;
    return (uint8_t)code;
}

static int16_t vbat_decode(uint8_t code)
{
    if (code == DATALOG_VBAT_NONE) return DATALOG_INVALID16;
    return (int16_t)(DATALOG_VBAT_BASE_MV + (int32_t)code * DATALOG_VBAT_STEP_MV);
}

