ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
static void pack_rec(uint8_t *b, const datalog_rec_t *r)
{
    memset(b, 0, DATALOG_REC_SIZE);
    put_u32(b + 0, r->seq);
    put_u32(b + 4, r->t_unix);
    put_u64(b + 8, r->freq_x100000);
    put_u16(b + 16, (uint16_t)r->t_ocxo_c100);
    put_u16(b + 18, (uint16_t)r->t_board_c100);
    put_u16(b + 20, (uint16_t)r->ocxo_vc_mv);
    put_u16(b + 22, (uint16_t)r->rf_mv);
    b[24] = r->flags;
    b[25] = r->sats;
    b[26] = r->hdop10;
    b[27] = vbat_encode(r->vbat_mv);
    put_u16(b + 28, crc16(b, 28));
}

static bool unpack_rec(const uint8_t *b, datalog_rec_t *r)
{
    uint32_t seq = get_u32(b + 0);
    if (seq == DATALOG_SEQ_EMPTY || seq == 0) return false;    /* prazdny slot */
    if (crc16(b, 28) != get_u16(b + 28)) return false;         /* poskozeny zaznam */
    r->seq           = seq;
    r->t_unix        = get_u32(b + 4);
    r->freq_x100000  = get_u64(b + 8);
    r->t_ocxo_c100   = (int16_t)get_u16(b + 16);
    r->t_board_c100  = (int16_t)get_u16(b + 18);
    r->ocxo_vc_mv    = (int16_t)get_u16(b + 20);
    r->rf_mv      = (int16_t)get_u16(b + 22);
    r->flags         = b[24];
    r->sats          = b[25];
    r->hdop10        = b[26];
    r->vbat_mv       = vbat_decode(b[27]);   /* stare zaznamy: 0 -> DATALOG_INVALID16 */
    return true;
}

/* ── Cas: "YYYY-MM-DD HH:MM:SS" (g_rtc_text, UTC) -> unix ──────────────────
 * RTC pise defaultTask, datalog_tick bezi ve stejnem tasku -> retezec je
 * konzistentni bez zamku. Ciste kalendarni (dny od epochy), bez time.h. */
static uint32_t days_from_civil(int y, int m, int d)
{
    y -= (m <= 2);                                   /* rok zacina brezenem */
    int era = (y >= 0 ? y : y - 399) / 400;
    unsigned yoe = (unsigned)(y - era * 400);
    unsigned doy = (unsigned)((153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1);
    unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
    return (uint32_t)((int32_t)era * 146097 + (int32_t)doe - 719468);   /* 1970-01-01 = 0 */
}

/* Rucni parser misto sscanf (mensi kod, zadna libc scanf zavislost) — cte pevne
 * "YYYY-MM-DD HH:MM:SS" a hlida ze na pozicich cislic OPRAVDU jsou cislice. */
static bool rd_num(const char *s, int n, int *out)
{
    int v = 0;
    for (int i = 0; i < n; i++) {
        if (s[i] < '0' || s[i] > '9') return false;
        v = v * 10 + (s[i] - '0');
    }
    *out = v;
    return true;
}

static uint32_t datalog_text_to_unix(const char *s)
{
    int Y, M, D, h, mi, sec;
    if (s == NULL || strlen(s) < 19) return 0;
    if (s[4] != '-' || s[7] != '-' || s[13] != ':' || s[16] != ':') return 0;
    if (!rd_num(s, 4, &Y) || !rd_num(s + 5, 2, &M) || !rd_num(s + 8, 2, &D)) return 0;
    if (!rd_num(s + 11, 2, &h) || !rd_num(s + 14, 2, &mi) || !rd_num(s + 17, 2, &sec)) return 0;
    if (Y < 1970 || Y > 2199 || M < 1 || M > 12 || D < 1 || D > 31) return 0;
    if (h > 23 || mi > 59 || sec > 60) return 0;
    return days_from_civil(Y, M, D) * 86400u + (uint32_t)(h * 3600 + mi * 60 + sec);
}

/* Verejny prevod aktualniho RTC (UTC) na unix — stejne pravidlo jako v zaznamu
 * (0 = RTC nesynchronizovano z GPS). Cte `g_rtc_text`/`g_rtc_synced`, ktere pise
 * defaultTask; volat VYHRADNE z defaultTasku (ipc_publish), jinak retez neni
 * konzistentni. Slouzi hlavne k naplneni `rtc_unix` v IPC snapshotu (web/SCPI). */
uint32_t datalog_now_unix(void)
{
    return g_rtc_synced ? datalog_text_to_unix((const char *)g_rtc_text) : 0u;
}

/* ── W25Q backend ─────────────────────────────────────────────────────────── */

/* Probe = plny w25q_init(), NE jen JEDEC: bez initu neni zapnute 4-byte
 * adresovani (EN4B) a `w25q_read` nad 16 MB by cetl uplne jinam. Volani je
 * idempotentni — syscfg_load ho uz mozna udelal, opakovani jen znovu srovna cip
 * (bezi pod qspiMutexHandle, takze do toho nikdo jiny nesahne). */
static bool w25q_be_probe(void) { return w25q_init(); }
static bool w25q_be_read(uint32_t off, uint8_t *buf, uint32_t len)
{
    return w25q_read(W25Q_DATA_BASE + off, buf, len);
}
static bool w25q_be_write(uint32_t off, const uint8_t *buf, uint32_t len)
{
    return w25q_write(W25Q_DATA_BASE + off, buf, len);
}
static bool w25q_be_erase(uint32_t off)
{
    return w25q_erase_sector(W25Q_DATA_BASE + off);
}

const datalog_backend_t datalog_backend_w25q = {
    .name = "W25Q", .probe = w25q_be_probe, .read = w25q_be_read,
    .write = w25q_be_write, .erase = w25q_be_erase,
    .erase_size = W25Q_SECTOR_SIZE, .capacity = W25Q_DATALOG_SIZE,  /* jen 1/3 DATA regionu, viz w25q_map.h */
};

/* ── Hledani pozice zapisu po bootu ───────────────────────────────────────────
 * Blok, ktery ma v PRVNIM zaznamu nejvyssi seq, je nejnovejsi (seq roste
 * monotonne pres cely region). V nem se pak linearne najde prvni volny slot.
 * Cte CELY 32B zaznam na blok a overuje jeho CRC (2026-08-16; drive jen 4 B se
 * seq, coz propustilo garbage — viz komentar ve skenu). Pri 5445 blocich
 * (1/3 DATA regionu) je to ~174 kB, ~38 ms @ 4,6 MB/s. Zbytecne to neroste:
 * QSPI cteni je stropovane pollingem FIFO, ne velikosti bloku.
 * ⚠️ Pro SD backend (erase_size == 0) je "blok" cely region a vnitrni scan by
 * byl linearni pres miliony zaznamu -> az bude SD ziva, nahradit BINARNIM
 * hledanim hranice seq (log je monotonni, takze binarni scan je primocary). */
static void find_head(void)
{
    uint32_t nblk = s_be->erase_size ? s_be->capacity / s_be->erase_size : 1u;
    uint32_t rpb  = RECS_PER_BLOCK(s_be);
    if (rpb == 0) rpb = s_be->capacity / DATALOG_REC_SIZE;   /* SD: jeden "blok" = cely region */

    uint32_t best_blk = 0, best_seq = 0;
    uint32_t blk_with_data = 0;         /* kolik bloku ma platny prvni zaznam (viz wrap nize) */
    bool found = false;
    for (uint32_t i = 0; i < nblk; i++) {
        /* ⚠️ Cte se CELY 32B zaznam a overuje se CRC (`unpack_rec`), ne jen 4 bajty
         * seq jako driv. Bez te kontroly prosel jako platny i GARBAGE z flash —
         * a protoze se bere blok s NEJVYSSIM seq, staci jediny poskozeny bajt,
         * aby si datalog myslel, ze hlava je uplne jinde. Presne to nastalo po
         * zmene kapacity regionu 2026-08-15: `seq` vyslo 3823341906 (~1,2 mld let
         * pri 10 s/zaznam) a stav logu byl cely mimo. */
        uint8_t b[DATALOG_REC_SIZE];
        datalog_rec_t probe;
        if (!s_be->read(i * s_be->erase_size, b, DATALOG_REC_SIZE)) continue;
        if (!unpack_rec(b, &probe)) continue;    /* prazdny NEBO poskozeny -> preskoc */
        uint32_t seq = probe.seq;
        blk_with_data++;
        if (!found || seq > best_seq) { found = true; best_seq = seq; best_blk = i; }
        /* ⚠️ Sken je 16352 QSPI transakci (cely DATA region po 4 KB blocich) a
         * `w25q_read` uvnitr POLLUJE FIFO bez yieldu. Bez tohoto ustoupeni by
         * defaultTask drzel CPU v kuse — a protoze prave defaultTask obnovuje
         * IWDG (watchdog_supervise), byl by dost dlouhy sken WATCHDOG RESET
         * (boot grace je jen 8 s). Yield po kazdych 512 blocich pusti ke slovu
         * UiTask/FpgaTask (heartbeaty) i zbytek smycky defaultTask. */
        if ((i & 511u) == 511u) osDelay(1);
    }

    if (!found) {                       /* prazdne uloziste */
        s_head = 0; s_seq = 0; s_count = 0; s_wrapped = false;
        return;
    }

