ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
    /* Prvni volny slot v nejnovejsim bloku.
     * ⚠️ Stejna CRC kontrola jako vyse (unpack_rec), NE jen syrovy `seq` — bez ni
     * tenhle vnitrni scan verí garbage stejne, jako to do 2026-08-16 delal vnejsi
     * (viz komentar u nej). Overeno na HW pres sondu 2026-08-17 PO fixu vnejsiho
     * scanu: `s_count` uz vyslo spravne (47043), ale `s_seq` byl 3823345955 —
     * temer identicka hodnota jako historicka garbage 3823341906 zminovana vyse
     * (stary obsah flash zpred zmenseni regionu 2026-08-15, ktery neni cisty 0xFF,
     * ale ani platny zaznam). Poskozeny/neplatny slot se ted bere jako HRANICE
     * hlavy stejne jako prazdny — dalsi realny zapis ho proste prepise spravnymi
     * daty (samo-opravne), takze zadne zvlastni osetreni netreba. */
    uint32_t base = best_blk * s_be->erase_size;
    uint32_t used = rpb;                /* default: blok je plny */
    uint32_t last = best_seq;
    for (uint32_t k = 0; k < rpb; k++) {
        uint8_t b[DATALOG_REC_SIZE];
        datalog_rec_t probe;
        if (!s_be->read(base + k * DATALOG_REC_SIZE, b, DATALOG_REC_SIZE)) { used = k; break; }
        if (!unpack_rec(b, &probe)) { used = k; break; }   /* prazdny NEBO poskozeny -> hranice */
        last = probe.seq;
    }
    s_seq  = last;
    s_head = base + used * DATALOG_REC_SIZE;
    if (s_head >= s_be->capacity) s_head = 0;

    /* ⚠️ Kolik zaznamu v logu JE, se pozna ze STAVU FLASH — ne z absolutni hodnoty
     * `seq`. Driv tu stalo `s_wrapped = (s_seq > cap_rec)`, coz mlcky predpoklada,
     * ze log zacal na seq=1 a od te doby se nezmenila kapacita ani se nic nesmazalo.
     * Po zmensení regionu na 1/3 (2026-08-15) to hlasilo PLNY log (696960 zaznamu),
     * zatimco realne jich bylo 42989 — export pak zbytecne prosel 653k prazdnych
     * slotu. `seq` navic po dostatecne dlouhem behu pretece, takze na nem pocet
     * zaznamu stavet nelze vubec.
     *
     * Pocitame z toho, kolik BLOKU ma platna data: bloky se plni sekvencne, takze
     * (pocet plnych bloku - 1) * rpb + zaznamy v bloku s hlavou. Kruh povazujeme
     * za obehnuty, kdyz maji data uz vsechny bloky krome jednoho — pri wrapu se
     * totiz nejstarsi blok prave smazal, takze prazdny zustava. */
    uint32_t cap_rec = s_be->capacity / DATALOG_REC_SIZE;
    s_wrapped = (nblk > 1u) && (blk_with_data >= nblk - 1u);
    if (s_wrapped) {
        s_count = cap_rec;
    } else {
        uint32_t c = (blk_with_data ? (blk_with_data - 1u) * rpb : 0u) + used;
        s_count = (c > cap_rec) ? cap_rec : c;
    }
}

void datalog_init(void)
{
    s_be = NULL; s_ready = false;

    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_READ_MS) != osOK) return;
    /* Volba ulozistě. AUTO = puvodni chovani (SD ma prednost — je vetsi a
     * vyjimatelna); FLASH/SD jsou vynucene. ⚠️ Pri vynucenem SD bez karty se
     * ZAMERNE nespadne na flash: kdo si rekl o SD, nema dostat log potichu
     * jinam, nez ceka — tise presmerovany log je horsi nez zadny. */
    if (s_store_pref == DATALOG_STORE_FLASH) {
        if (datalog_backend_w25q.probe()) s_be = &datalog_backend_w25q;
    } else if (s_store_pref == DATALOG_STORE_SD) {
        if (datalog_backend_sd.probe && datalog_backend_sd.probe()) s_be = &datalog_backend_sd;
    } else {
        if (datalog_backend_sd.probe && datalog_backend_sd.probe()) s_be = &datalog_backend_sd;
        else if (datalog_backend_w25q.probe())                      s_be = &datalog_backend_w25q;
    }
    /* Kapacita 0 by v write_rec/read_back znamenala deleni nulou -> backend s
     * nesmyslnou kapacitou radeji odmitnout (napr. nedokoncena SD implementace). */
    if (s_be != NULL && s_be->capacity < DATALOG_REC_SIZE) s_be = NULL;
    if (s_be != NULL) { find_head(); s_ready = true; }
    osMutexRelease(qspiMutexHandle);

    s_next_ms = HAL_GetTick() + (uint32_t)datalog_period_s() * 1000u;
    printf("datalog: %s %s (%lu zazn., seq %lu)\n",
           s_ready ? s_be->name : "--", s_ready ? "ready" : "NEDOSTUPNE",
           (unsigned long)s_count, (unsigned long)s_seq);
}

/* ── Sber jednoho vzorku ze zivych globalu ─────────────────────────────────── */

static int16_t sens_c100(sensor_id_t id)
{
    const sensor_stat_t *s = &g_sensors[id];
    if (!s->valid || s->samples == 0) return DATALOG_INVALID16;
    float v = s->last * 100.0f;
    if (v > 32000.0f || v < -32000.0f) return DATALOG_INVALID16;
    return (int16_t)(v < 0 ? v - 0.5f : v + 0.5f);
}

static int16_t sens_mv(sensor_id_t id)
{
    const sensor_stat_t *s = &g_sensors[id];
    if (!s->valid || s->samples == 0) return DATALOG_INVALID16;
    float v = s->last;
    if (v > 32000.0f || v < -32000.0f) return DATALOG_INVALID16;
    return (int16_t)(v + 0.5f);
}

static void sample(datalog_rec_t *r)
{
    memset(r, 0, sizeof *r);

    fpga_meas_t m;
    int use16 = 0;
    if (fpga_freq_get_last(&m)) {
        /* fpga_freq_select() ma vnitrni stav a smi ji volat JEN FpgaTask ->
         * tady jen precteme, ktera odbocka ma platna data (bez hystereze). */
        use16 = (m.error_flags & FPGA_ERR_MEAS) && !(m.status2 & FPGA_ST2_DIV16_ERR);
        r->freq_x100000 = use16 ? m.freq16_x100000 : m.frequency_x100000;
    }

    r->t_unix       = g_rtc_synced ? datalog_text_to_unix((const char *)g_rtc_text) : 0u;
    r->t_ocxo_c100  = sens_c100(SENS_T49);    /* OCXO */
    r->t_board_c100 = sens_c100(SENS_T48);    /* STM deska */
    r->ocxo_vc_mv   = sens_mv(SENS_ADS0);     /* ladici napeti */
    /* RF: ADS AIN1 je mV z AD8307; prevod na dBm dela UI (kalibrace g_calib).
     * Do logu jde SYROVE mV — kalibrace se muze zmenit, syrova hodnota ne. */
    r->rf_mv     = sens_mv(SENS_ADS1);
    r->vbat_mv      = sens_mv(SENS_VBAT);     /* zalozni CR2032 — trend stárnutí */

    gps_data_t g;
    gps_get(&g);
    uint8_t f = 0;
    if (g.valid)                                f |= DATALOG_F_GPS_VALID;
    if (g.fix_mode >= 3)                        f |= DATALOG_F_FIX_3D;
    if (g_spi_ok)                               f |= DATALOG_F_FPGA_LINK;
    if (g_freq_stale)                           f |= DATALOG_F_SIGNAL_LOST;
    if (use16)                                  f |= DATALOG_F_DIV16;
    if (!g.valid && g.fixes > 0)                f |= DATALOG_F_HOLDOVER;
    if (fpga_sim_active())                      f |= DATALOG_F_SIM;   /* emulovany kmitocet */
    /* 🔑 Reference vypadla behem tohohle vzorku -> mereni NEPLATI. Cte se ze
     * STICKY registru 247, takze se chyti i glitch kratsi nez perioda logu.
     * ⚠️ `LOS_XTAL` (bit2) se neuvazuje — krystal XA/XB neni osazen (trvale 1). */
    if (g_si5356_sticky & (SI5356_LOS_CLKIN | SI5356_PLL_LOL))
                                                f |= DATALOG_F_REF_LOSS;
    r->flags  = f;
    r->sats   = g.num_sat;
    r->hdop10 = (g.hdop > 0.0f && g.hdop < 25.0f) ? (uint8_t)(g.hdop * 10.0f + 0.5f) : 255u;
}

/* Zapise zaznam na s_head (vc. erase na hranici bloku). Ocekava drzeny mutex. */
static bool write_rec(const datalog_rec_t *r)
{
    if (s_be->erase_size && (s_head % s_be->erase_size) == 0) {
        /* Novy blok -> smazat (zahodi 128 nejstarsich zaznamu = kruh). */
        if (s_be->erase == NULL || !s_be->erase(s_head)) return false;
        if (s_head == 0 && s_seq != 0) s_wrapped = true;   /* obeh dokola */
    }
    uint8_t b[DATALOG_REC_SIZE];
    pack_rec(b, r);
    if (!s_be->write(s_head, b, DATALOG_REC_SIZE)) return false;

    s_head = (s_head + DATALOG_REC_SIZE) % s_be->capacity;
    s_seq  = r->seq;
    uint32_t cap_rec = s_be->capacity / DATALOG_REC_SIZE;
    if (s_count < cap_rec) s_count++;
    return true;
}

